/******************************************************************************
*
* 版权信息: Copyright (c) 2012, 杭州海康威视数字技术股份有限公司
* 文件名称：awb_lib.h
* 文件标识：AWB_LIB_H
* 摘    要：海康威视
* 作    者: 范蒙 陈碧泉 曾勇
* 日    期: 2013年9月22日
* 备    注: 自动白平衡算法静态库
*
* 当前版本: 3.8.6
* 版本说明: (2.2.1)加入初始值设置防错机制
	      (2.2.2)AWB AS和PCC算法参数结构加入4字节对齐
            (2.2.3)改善抓拍抗大片单色干扰内部参数
            (2.2.4)将R\B增益扩充到8倍，提供4倍、6倍和8倍的配置模式
            (3.0.0)添加加权方法
            (3.1.5)添加照度控制白平衡方法
            (3.5.0)添加蓝色优先、黄色优先、大面积单色、肤色白平衡
            (3.6.0)内存裁剪，优化内存，减小内存384k
            (3.7.0)添加镜面法的最终方案，添加权重相关的限制
            (3.7.2)默认点权重可配，过曝阈值改为128
            (3.8.0)添加树叶排除距离自动方法；自动缩放权重方法；支持64位平台
            (3.8.1)树叶距离可以手动配置负值如配置1030则d为1000-1030，
            			调整新自然光阈值为400和1000，添加白平衡锁定方法
            	(3.8.2)添加保存打印数据到dav目录的方法，、
            		可以用于自动抓取多天的统计信息和白平衡信息
            	(3.8.3)添加手动白平衡、添加通道号功能
            	(3.8.4)调整手动白平衡、白平衡锁定功能，调整
            			自动权重缩放、自动树叶dis缩放、功能调整，
            			AWB_LOW_LUM_LIMIT由3调整为0，兼容极低照度白平衡问题
            	(3.8.5)开启低照度下自动调整权重和自动调整树叶距离功能
            	(3.8.6)提供color priority模式下的聚类关闭接口
*******************************************************************************
*/

/*************************************************************************************************
*                          AWB LIB 使用说明 
*
*    1) 初始化阶段的调用顺序:
*        (1) 获取库内部所需的内存大小:				AWB_GetMemSize(), 获取内存大小后, 分配相应内存
*        (2) 创建句柄实例:							AWB_Create()
*        (3) 根据需求设置key param对应的值（必需）:	AWB_SetKeyParam()
*		 (4) 算法库主流程函数:						AWB_Process()
*    	
*    2) 在启用后, 如果要重传配置参数, 调用顺序如下:
*        (1) 根据需求设置key param对应的值: AWB_SetKeyParam() 
*
*    3) 获取版本号和版本时间: AWB_GetVersion()
*
*    4) 获取状态信息(包括等): AWB_GetStateParam()
*
*************************************************************************************************/ 

#ifndef _AWB_LIB_H_
#define _AWB_LIB_H_


#ifdef __cplusplus
extern "C" {
#endif
	
#include "mem_tab.h"
    
	
/*******************************************************************************************************************************
* 文件版本和时间宏声明
*******************************************************************************************************************************/
/* 当前版本号*/
#define HIK_AWB_MAJOR_VERSION      3  /* 主版本号，接口改动、功能增加、架构变更时递增，最大63 */
#define HIK_AWB_SUB_VERSION        8  /* 子版本号，性能优化、局部结构调整、模块内集成其他库的主版本提升时递增，最大31 */
#define HIK_AWB_REVISION_VERSION  6  /* 修正版本号，提供关闭color  p riority中聚类模块接口 */
	
/* 版本日期*/
#define HIK_AWB_VER_YEAR           2019          /* 年*/
#define HIK_AWB_VER_MONTH          3			/* 月*/
#define HIK_AWB_VER_DAY            21			/* 日*/
	
	
/**************************************************************************************************
* 宏定义
**************************************************************************************************/
#ifndef _HRESULT_DEFINED
#define _HRESULT_DEFINED
typedef int HRESULT;
#endif  /* !_HRESULT_DEFINED */
	
/* 错误码定义 */
#define HIK_AWB_LIB_S_OK					1             //成功	    
#define HIK_AWB_LIB_S_FAIL					0             //失败	        
#define HIK_AWB_LIB_E_PARA_NULL				0x80000000    //参数指针为空	    
#define HIK_AWB_LIB_E_MEM_NULL				0x80000001    //传入的内存为空   
#define HIK_AWB_LIB_E_MEM_OVER			    0x80000002    //内存溢出
#define HIK_AWB_LIB_E_PARAM_KEY				0x80000003    //错误的参数键值 
#define HIK_AWB_LIB_E_PARAM_VAL				0x80000004    //错误的参数值 

#define AWB_LINE_TAB_NUM			10



/* 所需内存 */
#define HIK_AWB_MTAB_NUM				    1		      

/* 配置数据所需内存大小（字节） */
#define HIK_AWB_CFG_DATA_LEN			    4352

/* AWB算法类型 */
typedef enum _AWB_TYPE
{
	AWB_TYPE_IPC_AS							= 0x00000010,   //(I) IPC算法(as)
	AWB_TYPE_ITC_AS							= 0x00000011,   //(I) 抓拍机算法(as)
	AWB_TYPE_IPC_PCC						= 0x00000012,   //(I) IPC算法(PCC)
	AWB_TYPE_ITC_PCC						= 0x00000013,   //(I) 抓拍机算法(PCC)
	AWB_TYPE_NULL							= 0x80000000    //(I) 直通
}AWB_TYPE;

/* AWB参数调试键值 */
typedef enum _AWB_PARAM_KEY
{
	// AWB
	AWB_SMOOTH_RATIO						= 0x00000010,   //(I) 视频帧间平滑
		
	AWB_R_GAIN_INIT							= 0x00000011,   //(I) R通道初始增益
	AWB_G_GAIN_INIT							= 0x00000012,   //(I) G通道初始增益
	AWB_B_GAIN_INIT							= 0x00000013,   //(I) B通道初始增益

	AWB_TOO_DARK_LIMIT						= 0x00000014,   //(I) 过暗阈值
	AWB_OVER_EXPOSE_LIMIT					= 0x00000015,   //(I) 过曝阈值

	AWB_SVAL_LOW_LIMIT						= 0x00000016,   //(I) 鲜艳阈值下限
	AWB_SVAL_OFFSET							= 0x00000017,   //(I) 鲜艳阈值偏移量

	AWB_K_GAIN_LOW							= 0x00000018,   //(I) 色温适应范围低阈值
	AWB_K_GAIN_HIGH							= 0x00000019,   //(I) 色温适应范围高阈值
	AWB_K_GAIN_RATIO						= 0x0000001a,   //(I) 色温适应范围比率

	AWB_ITC_WORKMODE						= 0x0000001b,   //(I) 抓拍机白平衡工作模式，0为视频，1为抓拍
	AWB_VALID_BLOCK_LIMIT					= 0x0000001c,   //(I) 有效块数至少占总块数的比例， 1024代表1
	AWB_PCC_SAT_RATIO    					= 0x0000001d,   //(I) 饱和度过滤比例，256代表1.0
	AWB_PCC_SMOOTH_COEF    					= 0x0000001e,   //(I) 平滑比率，256代表1.0
	AWB_KEY_CFG_DATA_ADDR    				= 0x0000001f,   //(I) 配置数据首地址
	AWB_GET_LIB_INFO							= 0x00000021,	//白平衡版本信息
	
	AWB_KEY_CEN_DATA_ADDR    				= 0x00000031,   //(I) 色温曲线点首地址
	AWB_KEY_ENABLE_AWB3    				= 0x00000032,   //使能色域加权
	AWB_KEY_LOW_LIGHT_START_DB 		= 0x00000033,  //低照度白平衡起始增益
	AWB_KEY_LOW_LIGHT_END_DB 		= 0x00000034,  //低照度白平衡终止增益
	AWB_KEY_ADD_LINE			= 0x00000035,  //添加加权曲线
	AWB_KEY_DELETE_LINE			= 0x00000036,  //删除加权曲线
	AWB_KEY_CHANGE_LINE			= 0x00000037,  //更改加权曲线
	AWB_KEY_GET_LINE_ADD			= 0x00000038,  //删除加权曲线
	AWB_KEY_GET_LINE_NUM			= 0x00000039,  //删除加权曲线
	AWB_KEY_TEST_WEIGHT    				= 0x00000040,   //使能色域加权
	AWB_KEY_DUSK_MODE_EN    				= 0x00000041,   //使能傍晚高色温模式
	AWB_KEY_PRINT_SAT_DATA    				= 0x00000042,   //打印白平衡统计数据
	AWB_KEY_RADIATION_LINE_ADD    				= 0x00000043,   //辐射曲线首地址，32位；例如下两tb，tb_1较窄，对纸箱树叶等保色能力更好；tb_2对镜头的兼容性更强，保色能力差于tb_1
	//S32 tb_1[] = {400, 397, 394, 390, 387, 382, 376, 361, 339, 312, 287, 266, 247, 230, 214, 200, 187, 175, 164, 154, 146, 138, 131, 125, 120, 115, 111, 106, 102, 98, 94, 90, 87, 83, 80, 77, 74, 71, 69, 66, 64, 61, 59, 57, 54, 52, 50, 48, 46, 44, 42, 40, 38, 36, 34, 33, 31, 29, 28, 26, 24, 23, 22, 20, 19, 18, 17, 15, 14, 13, 12, 11, 10, 9, 8};
	//S32 tb_2[] = {400, 398, 397, 395, 393, 390, 384, 375, 366, 356, 345, 332, 318, 303, 288, 272, 257, 242, 229, 217, 206, 195, 185, 176, 168, 160, 153, 145, 139, 132, 126, 120, 114, 109, 104, 99, 95, 91, 87, 83, 80, 76, 73, 70, 67, 64, 61, 58, 55, 52, 49, 47, 44, 41, 39, 36, 34, 32, 30, 28, 26, 24, 22, 21, 19, 18, 17, 15, 14, 13, 12, 11, 10, 9, 8};
	AWB_KEY_RADIATION_LINE_CNT    				= 0x00000044,   //辐射曲线buf数据个数
	AWB_KEY_AREA_INDEX    				= 0x00000045,	//白平衡色域的index
	AWB_KEY_LINE_CEN_W_ADD 				= 0x00000046,	//白平衡中心点权重配置
	//U08 wp[9]; wp[0-8] for LT, A, TL84, CWF, D50, D65, D75, D95, HT;
	//old, wp[] = {1, 2, 3, 3, 5, 4, 2, 2, 1};  warm, wp[] = {1, 1, 2, 2, 3, 4, 3, 2, 1}; default warm
	
	AWB_KEY_AUTO_LEAVES_D_ENABLE		= 0x00000047,	//树叶保持自动距离计算
	AWB_KEY_NATURE_MODE_ENABLE			= 0x00000051,	//自然光模式使能
	AWB_KEY_NATURE_MODE_LUX_THR_IN   	= 0x00000052,   //自然光模式的照度设置
	AWB_KEY_NATURE_MODE_LUX_THR_OUT    	= 0x00000053,   //非自然光模式的照度设置
	AWB_KEY_SUNLIGHT_MODE_LUX_THR    	= 0x00000054,   //太阳光模式照度设置
	AWB_KEY_NATURE_MODE_W_THR    		= 0x00000055,   //太阳光模式照度设置
	
	AWB_KEY_LEAVES_HOLD_ENABLE 				= 0x00000056,	//树叶保持加强版
	AWB_KEY_LEAVES_HOLD_DIS			= 0x00000057,	//树叶保持直线距錎50的距离
	AWB_KEY_SKIN_HOLD_ENABLE = 0x00000058,	//肤色保持使能
	AWB_KEY_COLOR_PRIORITY  = 0x00000059,	//颜色优先选项，0无优先，1位保黄色，2为保蓝色
	AWB_KEY_PRIORITY_RATIO = 0x0000005a,	//颜色优先的程度，默认值128，不建议调大

	AWB_KEY_AUTO_SAT_RATIO_ENABLE = 0x0000005b,	//自动判断多色温场景
	AWB_KEY_AUTO_SAT_MAX_WEIGHT = 0x0000005c,	//加权的最大值
	AWB_KEY_SCALE_RGB_TH = 0x0000005d,	//自动缩放阈值
	AWB_KEY_SCALE_WEIGHT = 0x0000005e,	//权重进行缩放, 范围1 -256，默认为1
	AWB_KEY_NORMAL_WEIGHT_THR = 0x0000005f, //权重阈值，大于阈值的点才被使用，默认0
	AWB_KEY_LUMA_WEIGHT_ADD = 0x00000060, //亮度权重表,格式: U08 luma_weight[255]
	//镜面法数组
	/* 
	1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1, 
	 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  2,  2,  2,  2,  2,  2, 
	 2,  2,  3,  3,  3,  3,  3,  4,  4,  4,  5,  5,  5,  6,  6,  6,  7,  7,  8,  8, 
	 9,  9, 10, 10, 11, 12, 12, 13, 13, 14, 15, 15, 16, 16, 17, 18, 18, 19, 19, 20, 
	20, 21, 21, 22, 22, 22, 23, 23, 24, 24, 24, 25, 25, 26, 26, 26, 27, 27, 27, 28, 
	28, 28, 28, 29, 29, 29, 29, 30, 30, 30, 30, 30, 31, 31, 31, 31, 31, 31, 31, 32, 
	32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 32, 31, 31, 31, 31, 31, 
	30, 30, 29, 29, 29, 28, 28, 27, 27, 26, 25, 25, 24, 24, 23, 22, 22, 21, 21, 20, 
	20, 19, 19, 18, 18, 17, 17, 16, 16, 15, 15, 14, 14, 13, 13, 12, 12, 11, 11, 10, 
	10,  9,  9,  8,  8,  7,  7,  6,  6,  6,  5,  5,  4,  4,  4,  3,  3,  3,  2,  2, 
	 2,  2,  2,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1, 
	 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1, 
	 1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1,  1
	 */
	AWB_KEY_AUTO_SCALE_WEIGHT_ENABLE = 0x00000061,	//自动权重进行缩放使能，默认开启
	AWB_KEY_MANUAL_R_GAIN = 0x00000065,
	AWB_KEY_MANUAL_G_GAIN = 0x00000066,
	AWB_KEY_MANUAL_B_GAIN = 0x00000067,
	AWB_KEY_LOCK  = 0x00000068,
	AWB_KEY_CLUSTER_CLOSE_ENABLE = 0x00000069,   //聚类开关

	AWB_KEY_ENABLE_PURE   				    = 0x00000071,   //使能大面积单色做法
	AWB_KEY_NORM_THR                     = 0x00000072,   //p-norm法选白点参数阈值 
	AWB_KEY_MIR_THR                     = 0x00000073,   //镜面法选白点参数阈值 
	AWB_KEY_HISTOGRAM_THR                     = 0x00000074,   //边缘法选白点参数阈值 
	AWB_KEY_CONNECT_THR                     = 0x00000075,   //连通区域参数阈值,判断相邻区域Cr/Cb相对差小于1/connect_thr判断为连通区域 
	/**********************  调试接口  ****************************************/
	AWB_DEBUG_PIN							= 0x00000080,    //debug_pin;
	AWB_KEY_SAVE_DATA_CNT = 0x00000081    //保存白平衡打印数据的文件个数
		
} AWB_PARAM_KEY;

/******************************************************************************
* 结构体定义
*******************************************************************************/


/* AWB创建句柄相关参数 */
typedef struct _AWB_PARAM_STRU
{
	AWB_TYPE		awb_type;					//(I) 白平衡算法类型
	int			awb_channel;					//(I) 白平衡通道号
	
	void			*cfg_data_addr;				//(I) 配置数据首地址

	unsigned char	reserved[64];				// 保留字段
	
} AWB_PARAM;


/* AWB最大增益模式配置参数*/
typedef enum _AWB_MAX_GAIN_OPTION
{

	AWB_MAX_GAIN_X4				= 0x00000001,    //最大白平衡增益4倍
	AWB_MAX_GAIN_X6				= 0x00000002,    //最大白平衡增益6倍
	AWB_MAX_GAIN_X8				= 0x00000003     //最大白平衡增益8倍
		
} AWB_MAX_GAIN_OPTION;


/* AWB运行参数  */
typedef struct _AWB_PROCESS_PARAM_STRU
{	
	
    	unsigned short *stat_data;                  //(I) 12bits白平衡输入数据，字节顺序（小端模式）为RRGGBBRRGGBB...
	unsigned short block_num;					//(I) 数据量，应不超过65535
	unsigned short ae_gain_db;
	unsigned int env_luv;					//环境照度
	
    	unsigned short r_gain;                      //(O) R通道增益，1024代表1.0
    	unsigned short g_gain;                      //(O) G通道增益
    	unsigned short b_gain;                      //(O) B通道增益
	
    unsigned short color_temp;                  //(O) 光源色温，单位开尔文

    AWB_MAX_GAIN_OPTION max_gain_option;  //最大增益选项，支持4倍、6倍、8倍
	
	unsigned char reserved[66];                 // 保留字段
	
} AWB_PROCESS_PARAM;

/*坐标点*/
typedef struct _AWB_CEN_COR
 {
	int x;
	int y;
	int pw;
 }AWB_CEN_COR;


 /* AWB line的标记号*/
 typedef enum _AWB_ADD_LINE_TAG
 {
 	LINE_ALL = 1,
 	A2TL84,
	TL842D50,
	D502D65,
	TL842D65,
	TL842CWF,
	D652D75,
	D752D95,
	D752HT,
	LT2A,
	TL2D50,
	TL2D65
 } AWB_ADD_LINE_TAG;

  /* AWB line的标记号*/
 typedef enum _AWB_COLOR_PRIOR
 {
 	AWB_NO_PRIOR = 0,
	AWB_YELLOW_FRIST,
	AWB_BLUE_FRIST,
	AWB_GREEN_FRIST
 } AWB_COLOR_PRIOR;

 /*中心线段结构体*/
  typedef struct _AWB_ADD_LINE
   {
	   AWB_CEN_COR st;
	   AWB_CEN_COR ed;
	   int sw;
	   int ew;
	   int dis;
	   AWB_ADD_LINE_TAG tag;
   }AWB_ADD_LINE;



/*******************************************************************************************************************************
* 接口函数声明
*******************************************************************************************************************************/
/*******************************************************************************************************************************
* 功  能：获取所需内存大小
* 参  数：param      -I 参数结构指针
*          mem_tab    -O 内存申请表
* 返回值：返回状态码
*******************************************************************************************************************************/
HRESULT AWB_GetMemSize(AWB_PARAM *param, MEM_TAB mem_tab[HIK_AWB_MTAB_NUM]); 

/*******************************************************************************************************************************
* 功  能：创建AWB模块
* 参  数：param      -I 参数结构指针
*          mem_tab    -I 内存申请表
*          **handle   -O 返回AWB模块句柄
* 返回值：返回状态码
*******************************************************************************************************************************/
HRESULT AWB_Create(AWB_PARAM *param, MEM_TAB mem_tab[HIK_AWB_MTAB_NUM], void **handle); 

/*******************************************************************************************************************************
* 功  能：统计一帧数据
* 参  数：handle  -IO   句柄(handle由AWB_Create返回)
*          param   -IO   处理参数结构体
* 返回值：返回状态码
*******************************************************************************************************************************/
HRESULT AWB_Process(void *handle, AWB_PROCESS_PARAM *param);

/*******************************************************************************************************************************
* 功  能：设置输出内部状态信息的回调函数指针
* 参  数：handle        -IO AWB模块句柄
*          chan_id       -I 设置通道号id
*          callback_parm -I 回调函数参数数据指针，实现在回调函数中调用库外部数据，如不需要可填NULL
*          callback_func -I 回调函数指针，形式为void (*debug_info_callback)(void *debug_info, U32 size, void *callback_param);
* 返回值：返回状态码
* 备  注：函数内部将callback_func设置为回调函数指针
*******************************************************************************************************************************/
HRESULT AWB_SetDebugInfoCallback(void *handle, unsigned short chan_id, void *callback_param, void *callback_func);

/*******************************************************************************************************************************
* 功  能：算法库参数调试接口，设置AWB的算法参数
* 参  数：handle      -IO 模块句柄
*          param_key   -I 参数键
*          param_val   -I 参数键值
* 返回值：返回状态码
*******************************************************************************************************************************/
HRESULT AWB_SetKeyParam(void *handle, AWB_PARAM_KEY param_key, signed long param_val);

/*******************************************************************************************************************************
* 功  能：算法库参数调试接口，获得AWB的算法参数
* 参  数：handle      -IO 模块句柄
*          param_key   -I 参数键
*          param_val   -O 参数键值
* 返回值：返回状态码
*******************************************************************************************************************************/
HRESULT AWB_GetKeyParam(void *handle, AWB_PARAM_KEY param_key, int *param_val);

/*******************************************************************************************************************************
* 功  能：获取当前编码版本信息
* 参  数：无
* 返回值：返回版本信息
* 备  注：版本信息格式为：版本号＋年（7位）＋月（4位）＋日（5位）
*          其中版本号为：主版本号（6位）＋子版本号（5位）＋修正版本号（5位）
*******************************************************************************************************************************/
unsigned int AWB_GetVersion();


#ifdef __cplusplus
}
#endif 


#endif /* _AWB_LIB_H_ */
